In [1]:
import pandas as pd

In [2]:
data = {'name': ['Rakesh', 'Ram', 'Mohan','Geeta'],
       'city': ['Patna','Bangalore','Delhi','patna'],
       'score': [78,89,45,90]}

In [3]:
data

{'name': ['Rakesh', 'Ram', 'Mohan', 'Geeta'],
 'city': ['Patna', 'Bangalore', 'Delhi', 'patna'],
 'score': [78, 89, 45, 90]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

     name       city  score
0  Rakesh      Patna     78
1     Ram  Bangalore     89
2   Mohan      Delhi     45
3   Geeta      patna     90

In [6]:
df['score']

0    78
1    89
2    45
3    90
Name: score, dtype: int64

In [7]:
df[df['score']==45]

    name   city  score
2  Mohan  Delhi     45

In [10]:
df[df['score']>60]

     name       city  score
0  Rakesh      Patna     78
1     Ram  Bangalore     89
3   Geeta      patna     90

In [11]:
df['name_city'] = df['name'] + '-' + df['city']

In [12]:
df['name_city']

0     Rakesh-Patna
1    Ram-Bangalore
2      Mohan-Delhi
3      Geeta-patna
Name: name_city, dtype: object

In [13]:
df

     name       city  score      name_city
0  Rakesh      Patna     78   Rakesh-Patna
1     Ram  Bangalore     89  Ram-Bangalore
2   Mohan      Delhi     45    Mohan-Delhi
3   Geeta      patna     90    Geeta-patna

In [14]:
pd.set_option('max_rows', 3)

In [15]:
df

      name   city  score     name_city
0   Rakesh  Patna     78  Rakesh-Patna
..     ...    ...    ...           ...
3    Geeta  patna     90   Geeta-patna

[4 rows x 4 columns]

In [16]:
pd.set_option('max_columns', 2)

In [17]:
df

      name  ...     name_city
0   Rakesh  ...  Rakesh-Patna
..     ...  ...           ...
3    Geeta  ...   Geeta-patna

[4 rows x 4 columns]

In [18]:
df['score'][0]

78

In [19]:
df['score'][0].astype(float)

78.0

In [20]:
df['score'][0].astype(str)

'78'